{
    "Projects": [
      {
        "title": "Blockchain and NFT Application in Higher Education",
        "body": "A blockchain-based application for higher education institutions, aimed at securing and verifying academic credentials using NFTs. The project includes a comprehensive system for issuing and managing digital certificates and records.",
        "link": "https://github.com/AhmedHossam8/Graduation-Project",
        "image": "/assets/graduationProject.png",
        "id": 1
      },
      {
        "title": "Weather App",
        "body": "A user-friendly web application offering convenient access to upcoming weather forecasts personalized to user locations. Designed the Frontend using Reactjs aesthetics with ASP.NET Core for backend, this app ensures accurate and engaging weather insights.",
        "link": "https://github.com/AhmedHossam8/WeatherApp",
        "image": "/assets/weatherProject.png",
        "id": 2
      },
      {
        "title": "Social Media Website",
        "body": "A social media website where users can post and view their profiles. Designed the Frontend using HTML, CSS, and Javascript. Developed the Backend API using Python and FastAPI Framework. Implemented PostgreSQL database using SQLAlchemy package.",
        "link": "https://github.com/AhmedHossam8/social-media-website",
        "image": "/assets/socialMediaProject.png",
        "id": 3
      },
      {
        "title": "Library System Website",
        "body": "An innovative library system website, offering users the ability to explore an extensive collection of books and supplementary information. Designed the Frontend using HTML, CSS, and Javascript, while integrated the Backend API with Node.js technology.",
        "link": "https://github.com/AhmedHossam8/LibrarySystem",
        "image": "/assets/librarySystemProject.jpeg",
        "id": 4
      },
      {
        "title": "Car Showroom Website",
        "body": "A car showroom platform that offers users the opportunity to seamlessly navigate through different car models, each accompanied by comprehensive details. Designed the Frontend using HTML, CSS, and Javascript, while integrated the Backend using PHP.",
        "link": "https://github.com/AhmedHossam8/Car-Showroom",
        "image": "/assets/carShowroomProject.jpg",
        "id": 5
      }
    ]
  }
  